name: "InceptionV1"
input: "inputs"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

layer {
  name: "Logits/reshape"
  type: "Reshape"
  bottom: "logits"
  top: "logits"
  reshape_param {
    shape {
      dim: 0
      dim: 0
    }
  }
}

layer {
  name: "Predictions"
  type: "Softmax"
  bottom: "logits"
  top: "Predictions"
}